Revit 2024 API
ExporterIFCUtils.ValidateCurveLoops Method
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static IList<CurveLoop> ValidateCurveLoops(
	IList<CurveLoop> curveLoops,
	XYZ extrDirVec
)
Visual Basic
Public Shared Function ValidateCurveLoops ( _
	curveLoops As IList(Of CurveLoop), _
	extrDirVec As XYZ _
) As IList(Of CurveLoop)
Visual C++
public:
static IList<CurveLoop^>^ ValidateCurveLoops(
	IList<CurveLoop^>^ curveLoops,
	XYZ^ extrDirVec
)
Parameters
curveLoops
Type: System.Collections.Generic.IList<CurveLoop>
extrDirVec
Type: Autodesk.Revit.DB.XYZ
See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace